// Add task
// Delete tasks
// вывод задач
// Вывод уведомлений
// Удаление всех задач
// Редактирование задач
// Сохранение в localstorage

// Модуль управления задачами (управлять массивом)
// - Получать все задачи
// - Устанавливать список задач
// - Добавить одну задачу
// - Удалить задачу

// Модуль генерации id
// - Генерированием id

// Модуль UI управление разметкой списка задач
// - добавление / удаление одной задачи
// - генерация списака задач в разметку
// - проверка наличия задач в списке и вывод уведомления о пустом списке

// Модуль работы с localstorage
// - обновление ls
// - метод получения задачь из ls

// Модуль notify управление уведомлениями
// - вывод и удаление сообщений

// Модуль Observer реализация подписки на события
